Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.BitmapTargetType
The target types of bitmaps in TS core.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.BitmapTargetType.DmHandle
Bitmap for DM Handles.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.BitmapTargetType.Cursor
Bitmap for custom cursor.